In [1]:
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline
import seaborn as sns

# 0. Carregando os arquivos

In [2]:
## CSV
fatoDet0 = pd.read_csv('Processado/FatoDetalhes_DadosModelagem.csv',sep=';')
## TXT
fatoCab0 = pd.read_csv('Processado/FatoCabecalho_DadosModelagem.txt',sep='\t')
## EXCEL
dim0     = pd.read_excel('Processado/Dimensoes_DadosModelagem.xlsx')

# 1. Vendo Fato Detalhes (produto)

In [3]:
fatoDet0.head()

   CupomID  ProdutoID  Quantidade Valor Desconto   Custo ValorLiquido
0    10308         69           1  2,12        0  1,8317       0,2883
1    10558         73           3  2,97        0  2,4057       0,5643
2    10259         37           1  4,37        0  3,7757       0,5943
3    11077         73           5  6,11   0,0605   5,838       0,2725
4    10752         69           3  6,57        0  5,3217       1,2483

In [4]:
fatoDet0.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2172 entries, 0 to 2171
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   CupomID       2172 non-null   int64
 1   ProdutoID     2172 non-null   int64
 2   Quantidade    2172 non-null   int64
 3   Valor         2172 non-null   object
 4   Desconto      2172 non-null   object
 5   Custo         2172 non-null   object
 6   ValorLiquido  2172 non-null   object
dtypes: int64(3), object(4)
memory usage: 118.9+ KB

In [5]:
fatoDet0['Valor']

0           2,12
1           2,97
2           4,37
3           6,11
4           6,57
          ...
2167     21077,2
2168    21109,55
2169     23334,6
2170     32075,2
2171    43755,12
Name: Valor, Length: 2172, dtype: object

## 1.1. Criando fatoDet1 para começar a mudança no dataset

Trocando a ',' por '.' nas celulas, para depois poder mudar 'Object' para 'float'

In [6]:
fatoDet1 = fatoDet0.copy()
for n in fatoDet0.columns[3:]:
    for l in range(0,2172):
        #print(n,'\n',l)
        fatoDet1[n][l] = fatoDet0[n][l].replace(',','.')

<ipython-input-6-f713bea4aaff>:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  fatoDet1[n][l] = fatoDet0[n][l].replace(',','.')

In [7]:
fatoDet1.head()

   CupomID  ProdutoID  Quantidade Valor Desconto   Custo ValorLiquido
0    10308         69           1  2.12        0  1.8317       0.2883
1    10558         73           3  2.97        0  2.4057       0.5643
2    10259         37           1  4.37        0  3.7757       0.5943
3    11077         73           5  6.11   0.0605   5.838       0.2725
4    10752         69           3  6.57        0  5.3217       1.2483

####################################################################

Fazendo a mudança do tipo de dado, passando de 'object' para 'float'

In [8]:
for n in fatoDet1.columns[3:]:
    fatoDet1[n] = fatoDet1[n].astype(float)

In [9]:
fatoDet1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2172 entries, 0 to 2171
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   CupomID       2172 non-null   int64
 1   ProdutoID     2172 non-null   int64
 2   Quantidade    2172 non-null   int64
 3   Valor         2172 non-null   float64
 4   Desconto      2172 non-null   float64
 5   Custo         2172 non-null   float64
 6   ValorLiquido  2172 non-null   float64
dtypes: float64(4), int64(3)
memory usage: 118.9 KB

####################################################################

Descrevendo melhor as features numericas, retirando os IDs

In [10]:
fatoDet1.describe().transpose()[2:]

,count,mean,std,min,25%,50%,75%,max
Quantidade,2172.0,23.967311,19.189360,1.0000,10.000000,20.00000,30.00000,150.0000
Valor,2172.0,820.970622,2002.528358,2.1200,154.260000,355.07000,796.40000,43755.1200
Desconto,2172.0,49.608513,226.864961,0.0000,0.000000,0.00000,26.83500,7292.5201
Custo,2172.0,653.911917,1577.331337,1.8317,123.350075,282.27510,648.23760,32160.0132
ValorLiquido,2172.0,167.058479,455.554312,0.2725,25.181250,63.57665,148.11525,11595.1069

# 2. Vendo Fato Cabeçalho (entrega/venda)

In [11]:
fatoCab0.head()

,Data,ClienteID,FuncionarioID,ValorFrete,CupomID,EmpresaFrete,DataEntrega
0,22/03/2018,78,11,"12,45",11081,Freight Express,05/04/2018
1,21/11/2016,62,3,"20,01",10637,One Liners,24/11/2016
2,16/09/2017,64,3,"20,36",11019,One Liners,03/10/2017
3,02/07/2017,80,11,"20,53",10982,Freight Express,04/07/2017
4,16/09/2016,28,5,"20,61",10328,Ship for U,29/09/2016

In [12]:
datas = ['Data','DataEntrega']
fatoCab1 = fatoCab0.copy()
for i in datas:
    fatoCab1[i] = pd.to_datetime(fatoCab0[i],format='%d/%m/%Y')

In [13]:
fatoCab1.head()

,Data,ClienteID,FuncionarioID,ValorFrete,CupomID,EmpresaFrete,DataEntrega
0,2018-03-22,78,11,"12,45",11081,Freight Express,2018-04-05
1,2016-11-21,62,3,"20,01",10637,One Liners,2016-11-24
2,2017-09-16,64,3,"20,36",11019,One Liners,2017-10-03
3,2017-07-02,80,11,"20,53",10982,Freight Express,2017-07-04
4,2016-09-16,28,5,"20,61",10328,Ship for U,2016-09-29

In [14]:
fatoCab1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 836 entries, 0 to 835
Data columns (total 7 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Data           836 non-null    datetime64[ns]
 1   ClienteID      836 non-null    int64
 2   FuncionarioID  836 non-null    int64
 3   ValorFrete     836 non-null    object
 4   CupomID        836 non-null    int64
 5   EmpresaFrete   836 non-null    object
 6   DataEntrega    836 non-null    datetime64[ns]
dtypes: datetime64[ns](2), int64(3), object(2)
memory usage: 45.8+ KB

####################################################################

Trocando virgulas por ponto nos numericos

In [15]:
for l in range(0,836):
    fatoCab1['ValorFrete'][l] = fatoCab0['ValorFrete'][l].replace(',','.')

<ipython-input-15-40a666c33c46>:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  fatoCab1['ValorFrete'][l] = fatoCab0['ValorFrete'][l].replace(',','.')

In [16]:
fatoCab1.head()

,Data,ClienteID,FuncionarioID,ValorFrete,CupomID,EmpresaFrete,DataEntrega
0,2018-03-22,78,11,12.45,11081,Freight Express,2018-04-05
1,2016-11-21,62,3,20.01,10637,One Liners,2016-11-24
2,2017-09-16,64,3,20.36,11019,One Liners,2017-10-03
3,2017-07-02,80,11,20.53,10982,Freight Express,2017-07-04
4,2016-09-16,28,5,20.61,10328,Ship for U,2016-09-29

####################################################################

Mudando a feature 'ValorFrete' de 'object' para 'float'

In [17]:
fatoCab1['ValorFrete'] = fatoCab1['ValorFrete'].astype(float)
fatoCab1['EmpresaFrete'] = fatoCab1['EmpresaFrete'].astype('category')

In [18]:
fatoCab1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 836 entries, 0 to 835
Data columns (total 7 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Data           836 non-null    datetime64[ns]
 1   ClienteID      836 non-null    int64
 2   FuncionarioID  836 non-null    int64
 3   ValorFrete     836 non-null    float64
 4   CupomID        836 non-null    int64
 5   EmpresaFrete   836 non-null    category
 6   DataEntrega    836 non-null    datetime64[ns]
dtypes: category(1), datetime64[ns](2), float64(1), int64(3)
memory usage: 40.2 KB

####################################################################

Verificando melhor as features numericas

In [19]:
fatoCab1.describe().transpose()[2:]

,count,mean,std,min,25%,50%,75%,max
ValorFrete,836.0,50.164043,17.466742,12.45,34.685,49.865,65.7525,79.96
CupomID,836.0,10665.500000,241.476707,10248.00,10456.750,10665.500,10874.2500,11083.00

# 3. Vendo Dimensão (cliente)

In [20]:
dim0.head()

,ClienteID,Cliente,NomeContato,Endereco,Cidade,Pais,PaisCodigo,Regiao,CEP,Latitude,Longitude,Fax,Telefone
0,1,Eintrach GS,Albert von Einstein,Obere Str. 57,Berlin,Germany,DE,Europe,12209.0,52.401482,13.099724,030-0076545,030-0074321
1,2,La Tienda de la Esquina,Paco el Maco,Avda. de la Constitución 2222,Mexico City,Mexico,MX,North America,5021.0,19.631915,-99.133418,(5) 555-3745,(5) 555-4729
2,3,La Ropa Vieja,Sancho Panza,C/ Ritual de lo Habitual 2312,Mexico City,Mexico,MX,North America,5023.0,19.545652,-99.138955,NaN,(5) 555-3932
3,4,Dr Jims Trousers,Carl Montgomery,120 Hanover Sq.,London,UK,GB,Europe,NaN,51.541599,-0.224499,(171) 555-6750,(171) 555-7788
4,5,Urras Shop,Urra Gurra Aktersnurra,Berguvsvägen 8,Gothenburg,Sweden,SE,Europe,NaN,57.811813,12.226721,0921-12 34 67,0921-12 34 65

In [21]:
dim0.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 90 entries, 0 to 89
Data columns (total 13 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   ClienteID    90 non-null     int64
 1   Cliente      90 non-null     object
 2   NomeContato  90 non-null     object
 3   Endereco     90 non-null     object
 4   Cidade       90 non-null     object
 5   Pais         90 non-null     object
 6   PaisCodigo   90 non-null     object
 7   Regiao       90 non-null     object
 8   CEP          66 non-null     float64
 9   Latitude     90 non-null     float64
 10  Longitude    90 non-null     float64
 11  Fax          66 non-null     object
 12  Telefone     88 non-null     object
dtypes: float64(3), int64(1), object(9)
memory usage: 9.3+ KB

####################################################################

Fazendo a mudança do tipo de dado, de 'object' para 'category'

In [22]:
dim1 = dim0.copy()
for i in dim1.columns:
    if(dim1[i].dtype == 'object'):
        dim1[i] = dim1[i].astype('category')

In [23]:
dim1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 90 entries, 0 to 89
Data columns (total 13 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   ClienteID    90 non-null     int64
 1   Cliente      90 non-null     category
 2   NomeContato  90 non-null     category
 3   Endereco     90 non-null     category
 4   Cidade       90 non-null     category
 5   Pais         90 non-null     category
 6   PaisCodigo   90 non-null     category
 7   Regiao       90 non-null     category
 8   CEP          66 non-null     float64
 9   Latitude     90 non-null     float64
 10  Longitude    90 non-null     float64
 11  Fax          66 non-null     category
 12  Telefone     88 non-null     category
dtypes: category(9), float64(3), int64(1)
memory usage: 24.2 KB

# 4. Avaliando possíveis dados Nan

In [24]:
def avaliando_NaN(df,colunas):
    count = 0
    for col in colunas:
        if (df[str(col)].isnull().sum() >= 1):
            print('Coluna que falta:',str(col))
            print('Qnt linhas:',df[str(col)].isnull().sum())
            print('\n')
            count = count + 1
        
    print('Quantidade de colunas com NaN:',count)

In [25]:
colunasFC1 = fatoCab1.columns
colunasFD1 = fatoDet1.columns
colunasDim = dim1.columns

avaliando_NaN(fatoCab1,colunasFC1)
avaliando_NaN(fatoDet1,colunasFD1)
avaliando_NaN(dim1,colunasDim)

Quantidade de colunas com NaN: 0
Quantidade de colunas com NaN: 0
Coluna que falta: CEP
Qnt linhas: 24


Coluna que falta: Fax
Qnt linhas: 24


Coluna que falta: Telefone
Qnt linhas: 2


Quantidade de colunas com NaN: 3